# Antidote Plugin Configuration
# This file defines all zsh plugins to be managed by antidote

# Core antidote plugin for oh-my-zsh compatibility
getantidote/use-omz

# Oh My Zsh core library
ohmyzsh/ohmyzsh path:lib

# Core utilities (verified to exist)
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/dirhistory
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/jsontools
ohmyzsh/ohmyzsh path:plugins/urltools
ohmyzsh/ohmyzsh path:plugins/web-search
ohmyzsh/ohmyzsh path:plugins/z

# Version managers (verified to exist)
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/rbenv
ohmyzsh/ohmyzsh path:plugins/rvm

# Languages & Frameworks (verified to exist)
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/yarn
ohmyzsh/ohmyzsh path:plugins/composer
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/rust
ohmyzsh/ohmyzsh path:plugins/golang
ohmyzsh/ohmyzsh path:plugins/ruby
ohmyzsh/ohmyzsh path:plugins/rails
ohmyzsh/ohmyzsh path:plugins/rake
ohmyzsh/ohmyzsh path:plugins/gem
ohmyzsh/ohmyzsh path:plugins/bundler
ohmyzsh/ohmyzsh path:plugins/coffee
ohmyzsh/ohmyzsh path:plugins/cake
ohmyzsh/ohmyzsh path:plugins/capistrano
ohmyzsh/ohmyzsh path:plugins/celery
ohmyzsh/ohmyzsh path:plugins/ember-cli
ohmyzsh/ohmyzsh path:plugins/gulp
ohmyzsh/ohmyzsh path:plugins/grunt
ohmyzsh/ohmyzsh path:plugins/heroku
ohmyzsh/ohmyzsh path:plugins/jira
ohmyzsh/ohmyzsh path:plugins/laravel
ohmyzsh/ohmyzsh path:plugins/laravel5
ohmyzsh/ohmyzsh path:plugins/lein
ohmyzsh/ohmyzsh path:plugins/mix
ohmyzsh/ohmyzsh path:plugins/mvn
ohmyzsh/ohmyzsh path:plugins/perl
ohmyzsh/ohmyzsh path:plugins/phing
ohmyzsh/ohmyzsh path:plugins/pipenv
ohmyzsh/ohmyzsh path:plugins/poetry
ohmyzsh/ohmyzsh path:plugins/react-native
ohmyzsh/ohmyzsh path:plugins/scala
ohmyzsh/ohmyzsh path:plugins/sbt
ohmyzsh/ohmyzsh path:plugins/spring
ohmyzsh/ohmyzsh path:plugins/symfony
ohmyzsh/ohmyzsh path:plugins/symfony2
ohmyzsh/ohmyzsh path:plugins/thor
ohmyzsh/ohmyzsh path:plugins/vagrant
ohmyzsh/ohmyzsh path:plugins/vagrant-prompt
ohmyzsh/ohmyzsh path:plugins/wp-cli
ohmyzsh/ohmyzsh path:plugins/yii
ohmyzsh/ohmyzsh path:plugins/yii2

# Cloud & DevOps (verified to exist)
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/azure
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/helm
ohmyzsh/ohmyzsh path:plugins/minikube
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/ansible
ohmyzsh/ohmyzsh path:plugins/cloudfoundry
ohmyzsh/ohmyzsh path:plugins/codeclimate
ohmyzsh/ohmyzsh path:plugins/gcloud
ohmyzsh/ohmyzsh path:plugins/kops
ohmyzsh/ohmyzsh path:plugins/kubectx
ohmyzsh/ohmyzsh path:plugins/salt

# Databases (verified to exist)
ohmyzsh/ohmyzsh path:plugins/postgres
ohmyzsh/ohmyzsh path:plugins/redis-cli
ohmyzsh/ohmyzsh path:plugins/mysql-macports

# Build Tools (verified to exist)
ohmyzsh/ohmyzsh path:plugins/ant
ohmyzsh/ohmyzsh path:plugins/bower
ohmyzsh/ohmyzsh path:plugins/debian
ohmyzsh/ohmyzsh path:plugins/fabric
ohmyzsh/ohmyzsh path:plugins/fastfile
ohmyzsh/ohmyzsh path:plugins/gradle
ohmyzsh/ohmyzsh path:plugins/macports
ohmyzsh/ohmyzsh path:plugins/mercurial
ohmyzsh/ohmyzsh path:plugins/ng
ohmyzsh/ohmyzsh path:plugins/pass
ohmyzsh/ohmyzsh path:plugins/pep8
ohmyzsh/ohmyzsh path:plugins/per-directory-history
ohmyzsh/ohmyzsh path:plugins/pow
ohmyzsh/ohmyzsh path:plugins/powder
ohmyzsh/ohmyzsh path:plugins/repo
ohmyzsh/ohmyzsh path:plugins/rsync
ohmyzsh/ohmyzsh path:plugins/sublime
ohmyzsh/ohmyzsh path:plugins/svn
ohmyzsh/ohmyzsh path:plugins/svn-fast-info
ohmyzsh/ohmyzsh path:plugins/systemadmin
ohmyzsh/ohmyzsh path:plugins/systemd
ohmyzsh/ohmyzsh path:plugins/taskwarrior
ohmyzsh/ohmyzsh path:plugins/terminitor
ohmyzsh/ohmyzsh path:plugins/textastic
ohmyzsh/ohmyzsh path:plugins/textmate
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/tmux-cssh
ohmyzsh/ohmyzsh path:plugins/tmuxinator
ohmyzsh/ohmyzsh path:plugins/torrent
ohmyzsh/ohmyzsh path:plugins/ubuntu
ohmyzsh/ohmyzsh path:plugins/ufw
ohmyzsh/ohmyzsh path:plugins/universalarchive
ohmyzsh/ohmyzsh path:plugins/vault
ohmyzsh/ohmyzsh path:plugins/vi-mode
ohmyzsh/ohmyzsh path:plugins/vim-interaction
ohmyzsh/ohmyzsh path:plugins/virtualenv
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/vundle
ohmyzsh/ohmyzsh path:plugins/wakeonlan
ohmyzsh/ohmyzsh path:plugins/watson
ohmyzsh/ohmyzsh path:plugins/wd
ohmyzsh/ohmyzsh path:plugins/xcode
ohmyzsh/ohmyzsh path:plugins/yum
ohmyzsh/ohmyzsh path:plugins/zbell
ohmyzsh/ohmyzsh path:plugins/zeus
ohmyzsh/ohmyzsh path:plugins/zoxide
ohmyzsh/ohmyzsh path:plugins/zsh-interactive-cd

# Custom completion plugins (these will be handled separately)
# aws-context
# aws-manager
# ecr-manager
# ssh-setup
